//зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:

let array = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
console.log(array);
let i=0;
   // 1. перебрати його циклом while
// while(i<10){
//     console.log(array[i]);
//     i++;
// }

  //  2. перебрати його циклом for

// for(i = 0; i < 10; i++){
//     console.log(array[i]);
// }
 //   3. перебрати циклом while та вивести  числа тільки з непарним індексом

// while(i < 10){
//     if (i % 2 !== 0){
//     console.log(array[i]);
//     }
//     i++;
// }

//4. перебрати циклом for та вивести  числа тільки з непарним індексом
// for(i = 0; i <10; i++){
//     if(i % 2 !==0){
//         console.log(array[i]);
//     }
// }

// 5. перебрати циклом while та вивести  числа тільки парні  значення
//  while(i <10){
//     if(array[i] % 2 == 0){
//         console.log(array[i]);
//     }
//     i++;
//  }

// 6. перебрати циклом for та вивести  числа тільки парні  значення
// for(i = 0; i <10; i++){
//     if(array[i] % 2 == 0){
//         console.log(array[i]);
//     }
// }

// 7. замінити кожне число кратне 3 на слово "okten"
// for(i =0; i <10; i++){
//     if(array[i] % 3 == 0){
//         array[i] = "okten";
//     }
//     document.write(`<div> ${array[i]} </div>`);
// }
// 8. вивести масив в зворотньому порядку.
//     for(i=9; i>=0; i--){
//         console.log(array[i]);
//     }

// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)

//7 замінити кожне число кратне 3 на слово "okten"
// for(i =9; i >= 0; i--){
//     if(array[i] % 3 == 0){
//         array[i] = "okten";
//     }
//     document.write(`<div> ${array[i]} </div>`);
// }

//6 числа тільки парні  значення
// for(i = 9; i >= 0; i--){
//     if(array[i] % 2 == 0){
//         console.log(array[i]);
//     }
// }

//5 числа тільки парні  значення
// let p = 9;
//  while(p<=9){
//     if(array[p] % 2 == 0){
//         console.log(array[p]);
//     }
//     p--;
//  }
 //4 вивести  числа тільки з непарним індексом

// for(i = 9; i >= 0; i--){
//     if(i % 2 !==0){
//         console.log(array[i]);
//     }
// }

//3 вивести  числа тільки з непарним індексом
// let g = array.length-1;
// while(g >=0){
//     if (g % 2 !== 0){
//     console.log(array[g]);
//     }
//     g--;
//}
//  2. перебрати його циклом for
//
// for(i = 9; i >= 0; i--){
//     console.log(array[i]);
// }

// 1. перебрати його циклом while
// let y =array.length-1;
// while(y>=0){
//     console.log(array[y]);
//     y--;
// }
